In [ ]:
#Import all the necessary library by usning the import function if you do not have an library install it using pip function (pip install library name)

In [1]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import seaborn as sns

In [ ]:
# To Import Dataset

In [2]:
df = pd.read_csv("C:/Users/saniyakhan/Downloads/Salaries.csv")

In [3]:
df.head()   #default first five records

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [4]:
df.head(35)   #for specific number of records

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500
20   AsstProf          B    4        4  Male   92000
21       Prof          A   33       30  Male  103106
22   AsstProf          A    4        2  Male   73000
23   AsstProf          A    2        0  Male   85000
24       Prof          A   30       23  Male   91100
25       Prof          B   35       31  Male   99418
26       Prof          A   38       19  Male  148750
27       Prof          A   45       43  Male  155865
28   AsstProf          B    7        2  Male   91300
29       Prof          B   21       20  Male  123683
30  AssocProf          B    9        7  Male  107008
31       Prof          B   22       21  Male  155750
32       Prof          A   27       19  Male  103275
33       Prof          B   18       18  Male  120000
34  AssocProf          B   12        8  Male  119800

In [6]:
df['rank'].dtype     #particular record datatype

dtype('O')

In [8]:
df.dtypes           #for all records datatype

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [9]:
df.info()     #Information about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [12]:
df.size      #total records of rows and columns

468

In [13]:
df.ndim       #number of dimensions

2

In [14]:
df.describe()         #range of records

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [18]:
df.max()     #maximum of each column

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [19]:
df.min()     #minimum of each column

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [20]:
df.mean()    #mean of all the column

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [21]:
df.count()    #no of counts in record

rank          78
discipline    78
phd           78
service       78
sex           78
salary        78
dtype: int64

In [22]:
df.head().mean()   #mean of first 5 records

phd            30.2
service        24.8
salary     125296.0
dtype: float64

In [23]:
df.head(12).mean() #mean for specific records

phd            29.250000
service        25.416667
salary     114303.583333
dtype: float64

In [31]:
df[['salary']].mean()

salary    108023.782051
dtype: float64

In [ ]:
#Groupby i.e Aggregate Function

In [32]:
df_rank = df.groupby(['rank'])    #group data using rank

In [33]:
df_rank.mean()        #calculate mean value for each numeric value per each group

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [34]:
df.groupby('rank')[['salary']].mean()    #the column by which we want to group then the operation

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [35]:
df.groupby('rank')[['salary','discipline']].mean()

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [37]:
df.groupby((['rank']),sort=False)[['salary']].mean()

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474

In [38]:
grouped=df.groupby('rank')

In [39]:
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [ ]:
#Data frame Filtering
#Any boolean operator can be used to subset the data

In [42]:
df_sub=df[df['rank']> 'salary']

In [43]:
df_f=df[df['rank']=='salary']

In [ ]:
#Dataframe Slicing
#Using integer location method i.e iloc

In [44]:
df.iloc[0]         #First row of a data frame

rank            Prof
discipline         B
phd               56
service           49
sex             Male
salary        186960
Name: 0, dtype: object

In [ ]:
df.iloc[i]     #ith row

In [46]:
df.iloc[-1]       #last row

rank            Prof
discipline         A
phd               23
service           15
sex           Female
salary        109646
Name: 77, dtype: object

In [47]:
df.iloc[:, 0]      #first column

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, Length: 78, dtype: object

In [48]:
df.iloc[:, -1]     #first column

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [49]:
df.iloc[0:7]      #first 7 column

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [52]:
df.iloc[:,0:2]       #first 2 columns

         rank discipline
0        Prof          B
1        Prof          A
2        Prof          A
3        Prof          A
4        Prof          B
..        ...        ...
73       Prof          B
74  AssocProf          B
75       Prof          B
76       Prof          A
77       Prof          A

[78 rows x 2 columns]

In [53]:
df.iloc[1:3, 0:2]       #first and second row and first 2 columns

   rank discipline
1  Prof          A
2  Prof          A

In [54]:
df.iloc[[0,5],[1,3]]       #first and fifth row

  discipline  service
0          B       49
5          A       20

In [ ]:
####PANDAS#####

In [ ]:
#Aggragte functions in Pandas

In [55]:
df[['rank','salary']].agg(['min','mean','max'])        #aggregate function by columns

           rank         salary
min   AssocProf   57800.000000
max        Prof  186960.000000
mean        NaN  108023.782051

In [56]:
df.describe()   #basic statistics

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [57]:
df.min()
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [58]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [60]:
df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [61]:
df.mode()

   rank discipline  phd  service     sex   salary
0  Prof          B  4.0      3.0  Female  92000.0
1   NaN        NaN  NaN      NaN    Male      NaN

In [62]:
df.var()

phd        1.562106e+02
service    1.473740e+02
salary     8.005313e+08
dtype: float64

In [63]:
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [64]:
df.sem()

phd           1.415168
service       1.374558
salary     3203.626259
dtype: float64

In [65]:
df.skew()

phd        0.634366
service    0.913750
salary     0.452103
dtype: float64

In [66]:
df.kurt()

phd        0.042504
service    0.608981
salary    -0.401713
dtype: float64